Autodesk.Revit.DB.Structure.FreeFormSetOrientationOptions
Orientation options for Aligned or 3D Path Free Form Rebar set.
Since:
2027
Since:
2027

Autodesk.Revit.DB.Structure.FreeFormSetOrientationOptions.PerpendicularToFace
Cutting planes are oriented perpendicular to a selected planar face, X or Y vector being the face normal.

Autodesk.Revit.DB.Structure.FreeFormSetOrientationOptions.ParallelToFace
Cutting planes are parallel to a selected planar face.

Autodesk.Revit.DB.Structure.FreeFormSetOrientationOptions.Vertical
Cutting planes are oriented vertically, X or Y vector being Z axis.

Autodesk.Revit.DB.Structure.FreeFormSetOrientationOptions.AlignedToDistributionPath
Cutting planes are perpendicular to the distribution path.